brew "neovim"
brew "ripgrep"
brew "fd"

# Language servers
brew "typescript-language-server"
brew "tailwindcss-language-server"
brew "bash-language-server"
brew "shellcheck"
brew "gopls"
brew "lua-language-server"
brew "vscode-langservers-extracted"
brew "yaml-language-server"
brew "pyright"
brew "metals"
brew "ruby-lsp"
brew "JetBrains/utils/kotlin-lsp"

brew "stow"
