brew "neovim", args: ["HEAD"]

# Tools
brew "ripgrep"
brew "fd"
brew "tree-sitter-cli"

# Language servers
brew "typescript-language-server"
brew "tailwindcss-language-server"
brew "bash-language-server"

brew "EskelinenAntti/cli/kotlin-lsp" if OS.mac?

brew "gopls"
brew "lua-language-server"
brew "vscode-langservers-extracted"
brew "yaml-language-server"
brew "pyright"
brew "metals"
brew "ruby-lsp"

# Formatters
brew "stylua"
brew "prettier"
brew "go"

brew "stow"
